export const agreementContent = <div style={{ textAlign: "left", color: "#000000", fontSize: "16px", padding: "10px" }}>
    尊敬的客户:
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;感谢您对我公司电力巡检APP的惠顾。电力巡检APP的所有权和运作权，以及受理具体业务的经营权归电力大学电网
    公司（及下属各电力公司）所有。在使用本APP之前，您必须完全同意以下所有服务条款：</p>
    <p> 一、定义</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1、 本APP：指电力大学电网公司（及下属各电力公司）电力巡检APP，网址为www.shuaiyuyu.cn。</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2、 用户/您：指同意并遵守本协议，完成本APP所有注册程序并经本APP确认，拥有本APP登录帐号和密码的自然人、法人、其他组织。</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3、 用户信息：指用户注册信息以及用户使用本APP用户服务时提交的、被本APP所知悉的交易信息。</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;4、 用户注册信息：指用户在本APP注册的各项信息，包括其后通过身份验证后修改所填写的内容。</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;5、 用户指令：本协议中，除非专门指明或声明，均指用户以数据电文形式向本APP提出的申请、要求，包括但不限于用户要求本APP提供、变更或取消其依据本APP业务流程可享有的各项服务的申请、要求。</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;6、 用户服务/产品使用协议：根据电力大学电网公司的业务规定或规则，用户与电力大学电网公司（及下属电力公司）就提供互联网服务事宜另行签署的协议和/或合同。</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;7、 用户服务：指本APP基于互联网方式向用户提供的业务宣传、业务查询、业务办理、电量电费查询、电费缴纳、客户服务等服务。</p>
    <p> 二、 协议条款的确认和接受</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1、 本APP在此特别提醒您，在您使用注册前请确实仔细阅读本协议，如果您对本协议的任何条款和/或将来随时可能修改、补充的条款有异议，您可选择不注册成为本APP的用户。</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2、 当您点选“同意”按钮时即视为您已仔细阅读本条款，同意接受本协议条款的所有规范包括接受本APP对本协议条款随时所做的任何修改，并愿受其拘束。</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3、 本APP有权在必要时修改本协议条款，协议条款一旦发生变动，将会在重要页面上提示修改内容。如果不同意所改动的内容，用户可以主动注销其用户帐号。如果用户继续享用本APP所提供的网络服务，则视为接受服务条款的变动。</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;4、 本APP保留在任何时候自行决定对本APP及其相关功能的变更、升级、修改、转移的权利。本APP进一步保留在本APP中开发新功能的权利。上述所有新的功能、软件服务的提供，除非本APP另有说明，否则仍适用本协议。</p>
    <p> 三、 服务内容</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1、 本APP将按照本协议及相关操作规程为用户提供相应的用户服务。本APP保证其所提供服务的合法性，并有义务在现有技术上维护整个网上服务及交易的正常运行，并努力提升和改进技术，使用户网上服务和交易活动得以顺利进行。</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2、 本APP所提供的用户服务包括：用户注册、APP登录、安全退出、找回密码、修改密码、业务办理查询、业务办理申请、电量电费查询、电费缴纳等服务，本APP有权根据实际情况的变化调整用户服务具体内容。</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3、 本APP仅提供网络服务，与网络服务有关的通信设备（如电脑、调制解调器及其他与接入互联网有关的装置）及通信服务所需的费用（如为接入互联网而支付的电话费及宽带费）由用户自行承担。</p>
    <p> 四、 使用规则</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1、 用户资料的真实性：用户保证自己在注册时用户身份的真实性和正确性及完整性，如果资料发生变化，用户应及时更改，本APP不能也不会对您的资料不真实、不准确，或您的资料未能及时更新，或因您丢失了身份号码和密码而引起的任何损失或损害承担责任。若用户提供任何错误、不实、过时或不完整的资料，并为本APP所确知；或者本APP有合理理由怀疑前述资料为错误、不实、过时或不完整，本APP有权暂停或终止用户的帐号，并拒绝现在或将来使用本服务的全部或一部分。
     电力大学电网公司或本APP有权对用户的注册数据及相关操作进行查阅，发现注册数据或相关操作中存在任何问题或怀疑，均有权向用户发出询问及要求改正的通知或者直接作出删除等处理。</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2、 用户帐号、密码：用户登陆帐号及密码为用户在本APP的唯一身份权证，为享受本APP提供的用户服务，您须按照对应的服务要求键入正确的客户登陆帐号及密码。
    您应保管好自己的客户登陆帐号和密码，在服务使用过程中可更改密码。非因本APP原因导致客户登陆帐号、密码遗失、遗忘或被他人窃取的，本APP不承担责任。如果用户发现自己的个人信息泄密，尤其是本APP帐户及密码发生泄露，立即致电13918437111。</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3、 您在使用本APP提供的用户服务过程中，必须遵守以下原则：</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;a、遵守中国有关的法律和法规；</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;b、不得为任何非法目的而使用本APP所提供网络服务系统；</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;c、遵守所有与网络服务有关的网络协议、规定和程序；</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;d、禁止出售、转售或复制、开发本APP授予的使用权限；</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;e、禁止基于商业目的模仿电力大学电网公司（及下属各电力公司）的产品和服务；</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;f、禁止复制和模仿电力大学电网公司及本APP的设计理念、界面、功能、图表、文档资料、软件、商标、FLASH、设计、图案、音像、摄影、动画、美术等；</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;g、禁止未经电力大学电网公司许可，基于本APP所提供的网络服务或其内容进行修改或制造派生其他产品；</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;h、禁止发送违反法律、法规、信息产业行业或电力大学电网公司相关规定的信息，并不违反社会公共利益或公共道德，禁止发送和储存带有病毒的、蠕虫的、木马的和其他有害的计算机代码、文件、脚本和程序。</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;i、不得利用本APP进行任何可能对互联网的正常运转造成不利影响的行为；</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;j、不得利用本APP传输任何非法、有害、胁迫、骚扰、侵害、中伤、粗俗、猥亵、诽谤、淫秽、侵害他人隐私、种族歧视或其他另人不快的包括但不限于文字、软件、音乐、照片、图形、视频或其他内容；</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;k、不得以任何方式危害未成年人；</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;l、不得冒充任何人或机构，或以虚伪不实的方式谎称而使人误认为与任何人或任何机构有关。</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;m、不得利用本APP进行干扰或扰乱本公司客户服务、通信服务及其他客户正常使用的行为；</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;n、不得有意诋毁、损害电力大学电网公司（及下属各电力公司）声誉或恶意攻击本APP的信息平台系统，不得利用APP进行不利于家电网公司（及下属各电力公司）的行为；</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;o、在未经许可的情况下非法进入其它电脑系统；</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;4、 用户承诺其通过本APP服务进行活动引发的一切后果，由其承担全部责任。如因用户使用本APP的行为，导致电力大学电网公司（及下属各电力公司）为此承担了相关的责任，用户需全额赔偿电力大学电网公司（及下属各电力公司）的相关支出及损失，包括律师费用、诉讼费等</p>
    <p> 五、 用户隐私</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1、 本APP保证不对外公开或向第三方提供用户注册资料及用户在使用网络服务时存储在本APP上的非公开内容，但下列情况除外：</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;a、事先获得用户的明确授权；</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;b、根据有关的法律法规要求；</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;c、按照相关政府主管部门的要求；</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;d、为维护社会公众的利益；</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;e、为维护本APP或用户的合法权益；</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;f、不可抗力所导致的用户信息公开；</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;g、不能归咎于本站的客观情势，所导致的个人资料的公开；</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;h、由于本APP的硬件和软件的能力限制，所导致用户信息的公开；</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;i、本APP有充分理由相信用户信息的公开，符合本站和用户利益要求的。</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2、 在不透露单个用户信息的前提下，本APP有权对整个用户数据库进行分析并对用户数据库进行利用。</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3、 本APP应在其网络系统内建立合理的安全体系，包括身份识别体系、内部安全防范体系，以使用户数据完整，并且保密。但用户了解并同意技术手段在不断更新，本APP无法杜绝全部的非安全因素，但本APP会及时更新体系，妥善维护网络及相关数据。</p>
    <p> 六、 服务变更、中断或终止</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1、 如因系统维护或升级的需要而需暂停网络服务本APP将尽可能事先进行通告。</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2、 本APP有权判定您的行为是否符合本APP有关要求，出现包括但不限于以下情形的，本APP有权单方在不作通知的情况下终止对您提供的客户服务，由此产生的风险及责任由您自行承担。如造成本APP损失的，您还应承担赔偿等责任：</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;a、用户提供的注册资料不真实；</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;b、用户违反本协议中规定的使用规则。</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3、 用户完成APP的注销手续时，本协议即为终止；</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;4、 本协议的终止并不意味着终止前所发生的未完成客户指令的撤销，也不能消除因终止前的交易所带来的法律后果。</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;5、 本APP保留在不事先通知用户的情况下随时中断或终止部分或全部网络服务的权利，对于所有服务的中断或终止而造成的任何损失，本APP无需对用户或任何第三方承担任何责任。</p>
    <p> 七、 免责声明</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1、 本APP尽力向客户提供优质服务，但不能保证客户服务一定满足客户要求，也不保证客户服务不会受中断。</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2、 本APP所发布的信息中可能没有包含与我公司业务有关的最新信息。本APP所提供的信息，只供参考之用。</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3、 用户明确同意其使用本APP服务所存在的风险将完全由其自己承担；因其使用本网络服务而产生的一切后果也由其自己承担。</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;4、 在所适用的法律允许的范围内，任何一方均无须就数据的丢失和/或损坏及任何间接的、附带的、特殊的、后果性的损失向另一方负责赔偿。</p>
    <p> 八、 不可抗力</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;如果由于黑客攻击或政府管制或网络通讯瘫痪等用户对其发生和后果不能预见的事件，双方均确认此属不可抗力；双方应按照不可抗力对影响履行本协议的程度，协商决定是否解除本协议、免除履行本协议的部分义务，或者延期履行本协议。</p>
    <p> 九、 法律适用</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;本协议适用中华人民共和国法律法规，您和本APP一致同意服从相关法律法规以及本协议的规定。如果本协议的部分条款在任何时候变成不合法、无效或不可强制执行而不从根本上影响本协议的效力时，本协议的其它条款不受影响。</p>
</div>

export const phoneNumberCheck = /^(13[0-9]|15[0-9]|17[0-9]|18[0-9]|14[0-9])[0-9]{8}$/;